Revit 2026 API

# SpecTypeIdInt Class

---

This class contains constants identifying integer specs.

SystemObject Autodesk.Revit.DBSpecTypeIdInt

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Int
```
```vb
Public NotInheritable Class Int
```
```cpp
public ref class Int abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Int = class end
```

The SpecTypeIdInt type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Integer | Integer, in discipline Common. |
|  | NumberOfPoles | Number of Poles, in discipline Electrical. |

#### Reference

Autodesk.Revit.DB Namespace